#### Terraform Plan 📖`success`
#### `Plan: 0 to add, 6 to change, 3 to destroy.`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Stromweld/tf_repo_manager/runs/run-aiSs1qyzghFNwC1z

Waiting for the plan to start...

Terraform v1.13.4
on linux_amd64
Initializing plugins and modules...
module.other_repos.module.looper["github-org-collaborators"].module.repository.github_repository.this: Refreshing state... [id=github-org-collaborators]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_repository.this: Refreshing state... [id=Chef_AD_DNS_Solarwinds_Spacewalk]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_repository.this: Refreshing state... [id=tf_repo_manager]
module.other_repos.module.looper["github-workflows"].module.repository.github_repository.this: Refreshing state... [id=github-workflows]
module.other_repos.module.looper["chef-repo"].module.repository.github_repository.this: Refreshing state... [id=chef-repo]
module.other_repos.module.looper["kickstart"].module.repository.github_repository.this: Refreshing state... [id=kickstart]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_repository.this: Refreshing state... [id=aws_temp_saml_creds]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_repository.this: Refreshing state... [id=terraform-tfe-workspaces]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_repository.this: Refreshing state... [id=terraform-tfe-private-modules]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_repository.this: Refreshing state... [id=terraform-github-repositories]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_repository.this: Refreshing state... [id=chef_autopatch_ii]
module.chef_cb_repos.module.looper["chef_nginx_webserver_config"].module.repository.github_repository.this: Refreshing state... [id=chef_nginx_webserver_config]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_repository.this: Refreshing state... [id=chef_base_config]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_repository.this: Refreshing state... [id=chef_collectd_ii]
module.chef_cb_repos.module.looper["chef-360"].module.repository.github_repository.this: Refreshing state... [id=chef-360]
module.chef_cb_repos.module.looper["chef_automate_role"].module.repository.github_repository.this: Refreshing state... [id=chef_automate_role]
module.chef_cb_repos.module.looper["chef_chef360_role"].module.repository.github_repository.this: Refreshing state... [id=chef_chef360_role]
module.chef_cb_repos.module.looper["chef_homeserver_role"].module.repository.github_repository.this: Refreshing state... [id=chef_homeserver_role]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository.this: Refreshing state... [id=chef_timezone_iii]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_repository.this: Refreshing state... [id=chef_base_role]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_repository.this: Refreshing state... [id=chef_chef_software]
module.chef_cb_repos.module.looper["chef_certificates_config"].module.repository.github_repository.this: Refreshing state... [id=chef_certificates_config]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_repository.this: Refreshing state... [id=chef_automate_ha]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_repository.this: Refreshing state... [id=chef_artifactory_ii]
module.chef_cb_repos.module.looper["chef_server_role"].module.repository.github_repository.this: Refreshing state... [id=chef_server_role]
module.chef_cb_repos.module.looper["chef_supermarket_role"].module.repository.github_repository.this: Refreshing state... [id=chef_supermarket_role]
tfe_oauth_client.github: Refreshing state... [id=oc-My3Z8GgnzemkfQKc]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.tf_workspace["default"].tfe_workspace.workspace: Refreshing state... [id=ws-sKUnXifAZaTLrKVo]
module.other_repos.module.looper["github-workflows"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["kickstart"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["chef-repo"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["github-org-collaborators"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_actions_secret.this["TOKEN_TFC"]: Refreshing state... [id=terraform-tfe-private-modules:TOKEN_TFC]
module.other_repos.module.looper["github-workflows"].module.repository.data.github_branch.main: Read complete after 1s [id=github-workflows:main]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_actions_secret.this["TOKEN_TFC"]: Refreshing state... [id=terraform-tfe-workspaces:TOKEN_TFC]
module.other_repos.module.looper["kickstart"].module.repository.data.github_branch.main: Read complete after 1s [id=kickstart:main]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_actions_secret.this["TOKEN_TFC"]: Refreshing state... [id=terraform-github-repositories:TOKEN_TFC]
module.other_repos.module.looper["chef-repo"].module.repository.data.github_branch.main: Read complete after 1s [id=chef-repo:main]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.tf_workspace["default"].tfe_workspace_settings.this: Refreshing state... [id=ws-sKUnXifAZaTLrKVo]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.data.github_branch.main: Read complete after 2s [id=aws_temp_saml_creds:main]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.data.github_branch.main: Read complete after 2s [id=Chef_AD_DNS_Solarwinds_Spacewalk:main]
module.chef_cb_repos.module.looper["chef-360"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_homeserver_role"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["github-org-collaborators"].module.repository.data.github_branch.main: Read complete after 1s [id=github-org-collaborators:main]
module.chef_cb_repos.module.looper["chef_certificates_config"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.data.github_branch.main: Read complete after 1s [id=terraform-tfe-workspaces:main]
module.chef_cb_repos.module.looper["chef_server_role"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.data.github_branch.main: Read complete after 1s [id=terraform-tfe-private-modules:main]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.data.github_branch.main: Read complete after 1s [id=terraform-github-repositories:main]
module.chef_cb_repos.module.looper["chef_automate_role"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_nginx_webserver_config"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_supermarket_role"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.data.github_branch.main: Read complete after 0s [id=chef_collectd_ii:main]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef-360"].module.repository.data.github_branch.main: Read complete after 1s [id=chef-360:main]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_homeserver_role"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_homeserver_role:main]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_certificates_config"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_certificates_config:main]
module.chef_cb_repos.module.looper["chef_chef360_role"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_server_role"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_server_role:main]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_base_config:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_base_config:main]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository_collaborator.this["limitusus"]: Refreshing state... [id=chef_timezone_iii:limitusus]
module.chef_cb_repos.module.looper["chef_automate_role"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_automate_role:main]
module.chef_cb_repos.module.looper["chef_chef360_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_chef360_role:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_artifactory_ii:main]
module.chef_cb_repos.module.looper["chef_homeserver_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_homeserver_role:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_nginx_webserver_config"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_nginx_webserver_config:main]
module.chef_cb_repos.module.looper["chef_nginx_webserver_config"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_nginx_webserver_config:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_supermarket_role"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_supermarket_role:main]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_base_role:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.data.github_branch.main: Read complete after 2s [id=chef_autopatch_ii:main]
module.chef_cb_repos.module.looper["chef_server_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_server_role:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_automate_ha:main]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_timezone_iii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_base_role:main]
module.chef_cb_repos.module.looper["chef_certificates_config"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_certificates_config:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_chef360_role"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_chef360_role:main]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_collectd_ii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_automate_ha:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_automate_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_automate_role:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_chef_software:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_autopatch_ii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_artifactory_ii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef-360"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef-360:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_supermarket_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_supermarket_role:SUPERMARKET_KEY]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_branch_default.this: Refreshing state... [id=tf_repo_manager]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHSeHTM4Bh7gF]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_branch_default.this: Refreshing state... [id=aws_temp_saml_creds]
module.other_repos.module.looper["github-workflows"].module.repository.github_branch_default.this: Refreshing state... [id=github-workflows]
module.other_repos.module.looper["chef-repo"].module.repository.github_branch_default.this: Refreshing state... [id=chef-repo]
module.other_repos.module.looper["kickstart"].module.repository.github_branch_default.this: Refreshing state... [id=kickstart]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_branch_default.this: Refreshing state... [id=Chef_AD_DNS_Solarwinds_Spacewalk]
module.other_repos.module.looper["github-org-collaborators"].module.repository.github_branch_default.this: Refreshing state... [id=github-org-collaborators]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOFQgqW84Bh7gA]
module.other_repos.module.looper["github-workflows"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwbc4BiWy2]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOBP18Nc4Bh7f_]
module.other_repos.module.looper["chef-repo"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOCbdKjM4Bh7f-]
module.other_repos.module.looper["kickstart"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOCW9ReM4Bh7gC]
module.other_repos.module.looper["github-org-collaborators"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOJvEX3M4CSnTe]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_branch_default.this: Refreshing state... [id=terraform-tfe-workspaces]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_branch_default.this: Refreshing state... [id=terraform-github-repositories]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_branch_default.this: Refreshing state... [id=terraform-tfe-private-modules]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwQ84BiWy1]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwT84BiWy3]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwe84BiWy6]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_artifactory_ii]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_branch_default.this: Refreshing state... [id=chef_base_config]
module.chef_cb_repos.module.looper["chef_supermarket_role"].module.repository.github_branch_default.this: Refreshing state... [id=chef_supermarket_role]
module.chef_cb_repos.module.looper["chef_automate_role"].module.repository.github_branch_default.this: Refreshing state... [id=chef_automate_role]
module.chef_cb_repos.module.looper["chef-360"].module.repository.github_branch_default.this: Refreshing state... [id=chef-360]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_branch_default.this: Refreshing state... [id=chef_base_role]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch_default.this: Refreshing state... [id=chef_chef_software]
module.chef_cb_repos.module.looper["chef_homeserver_role"].module.repository.github_branch_default.this: Refreshing state... [id=chef_homeserver_role]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_timezone_iii]
module.chef_cb_repos.module.looper["chef_nginx_webserver_config"].module.repository.github_branch_default.this: Refreshing state... [id=chef_nginx_webserver_config]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_branch_default.this: Refreshing state... [id=chef_automate_ha]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_autopatch_ii]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_collectd_ii]
module.chef_cb_repos.module.looper["chef_server_role"].module.repository.github_branch_default.this: Refreshing state... [id=chef_server_role]
module.chef_cb_repos.module.looper["chef_chef360_role"].module.repository.github_branch_default.this: Refreshing state... [id=chef_chef360_role]
module.chef_cb_repos.module.looper["chef_certificates_config"].module.repository.github_branch_default.this: Refreshing state... [id=chef_certificates_config]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOIhNU984B34HL]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE3]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE1]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOCbOQcM4Bh7gD]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY0NzAy]
module.chef_cb_repos.module.looper["chef_certificates_config"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOQEWjgc4EGTP8]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzU5Mzgw]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.tf_module[0].tfe_registry_module.tf_module: Refreshing state... [id=mod-cePnVEzzY2MwYRNw]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.tf_module[0].tfe_registry_module.tf_module: Refreshing state... [id=mod-mHz65UZ77CqY4nFa]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.tf_module[0].tfe_registry_module.tf_module: Refreshing state... [id=mod-bjcjq8rHd2mYxoSq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_chef_software"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch_protection.default["main"] will be destroyed
  # (because key ["main"] is not in for_each map)
  - resource "github_branch_protection" "default" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - enforce_admins                  = true -> null
      - force_push_bypassers            = [] -> null
      - id                              = "BPR_kwDOCbOQcM4Bh7gD" -> null
      - lock_branch                     = false -> null
      - pattern                         = "main" -> null
      - repository_id                   = "MDEwOlJlcG9zaXRvcnkxNjI3NjI4NjQ=" -> null
      - require_conversation_resolution = true -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - require_last_push_approval      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }

      - required_status_checks {
          - contexts = [
              - "check",
            ] -> null
          - strict   = true -> null
        }
    }

  # module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "chef_chef_software"
        name                        = "chef_chef_software"
      ~ visibility                  = "public" -> "private"
        # (38 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_timezone_iii"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_branch_protection.default["main"] will be destroyed
  # (because key ["main"] is not in for_each map)
  - resource "github_branch_protection" "default" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - enforce_admins                  = true -> null
      - force_push_bypassers            = [] -> null
      - id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzU5Mzgw" -> null
      - lock_branch                     = false -> null
      - pattern                         = "main" -> null
      - repository_id                   = "MDEwOlJlcG9zaXRvcnk4ODY2Mjc4NA==" -> null
      - require_conversation_resolution = true -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - require_last_push_approval      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }

      - required_status_checks {
          - contexts = [
              - "check",
            ] -> null
          - strict   = true -> null
        }
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "chef_timezone_iii"
        name                        = "chef_timezone_iii"
      ~ visibility                  = "public" -> "private"
        # (38 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.tf_modules_repos.module.looper["terraform-github-repositories"].module.tf_module[0].tfe_registry_module.tf_module will be updated in-place
  ~ resource "tfe_registry_module" "tf_module" {
        id                   = "mod-mHz65UZ77CqY4nFa"
        name                 = "repositories"
        # (6 unchanged attributes hidden)

      + test_config {
          + tests_enabled = false
        }

        # (1 unchanged block hidden)
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.tf_module[0].tfe_registry_module.tf_module will be updated in-place
  ~ resource "tfe_registry_module" "tf_module" {
        id                   = "mod-bjcjq8rHd2mYxoSq"
        name                 = "private-modules"
        # (6 unchanged attributes hidden)

      + test_config {
          + tests_enabled = false
        }

        # (1 unchanged block hidden)
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.tf_module[0].tfe_registry_module.tf_module will be updated in-place
  ~ resource "tfe_registry_module" "tf_module" {
        id                   = "mod-cePnVEzzY2MwYRNw"
        name                 = "workspaces"
        # (6 unchanged attributes hidden)

      + test_config {
          + tests_enabled = false
        }

        # (1 unchanged block hidden)
    }

  # module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "tf_repo_manager"
      + sha        = (known after apply)
    }

  # module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_branch_protection.default["main"] will be destroyed
  # (because key ["main"] is not in for_each map)
  - resource "github_branch_protection" "default" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - enforce_admins                  = true -> null
      - force_push_bypassers            = [] -> null
      - id                              = "BPR_kwDOHSeHTM4Bh7gF" -> null
      - lock_branch                     = false -> null
      - pattern                         = "main" -> null
      - repository_id                   = "R_kgDOHSeHTA" -> null
      - require_conversation_resolution = true -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - require_last_push_approval      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }

      - required_status_checks {
          - contexts = [
              - "check",
            ] -> null
          - strict   = true -> null
        }
    }

  # module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "tf_repo_manager"
        name                        = "tf_repo_manager"
      ~ visibility                  = "public" -> "private"
        # (38 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 6 to change, 3 to destroy.


```

</details>

*Pushed by: @Stromweld, Action: `pull_request`*